app/controllers/messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."phone_number" = '+14129807501' LIMIT 1
INSERT INTO "messages" ("content", "created_at", "flag", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Hi. How are you?"], ["created_at", Tue, 12 Mar 2013 21:51:55 UTC +00:00], ["flag", true], ["phone_number", "+14129807501"], ["updated_at", Tue, 12 Mar 2013 21:51:55 UTC +00:00]]
SELECT "cartoons".* FROM "cartoons" WHERE "cartoons"."id" = 30 LIMIT 1
UPDATE "messages" SET "cartoon_id" = 3, "updated_at" = '2013-03-26 18:59:46.429718' WHERE "messages"."id" = 64
---
  def new
    m = Message.where(:phone_number => params[:From]).first
    message = Message.create( content: params[:Body], phone_number: params[:From], location: params[:FromCity], flag: true)
    if m.nil?
      message.cartoon = Cartoon.find(:first,:offset=>rand(Cartoon.count))
      message.save